/*
Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. 
Выполнить с помощью рекурсии.

N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
*/

int GetNumber(string message)
{
    int result = 0;

    while(true)
    {
        Console.Write (message);

        if(int.TryParse(Console.ReadLine(), out result))
        {
            break;
        }
        else
        {
            Console.WriteLine("Ввели не число");
        }
    }

    return result;
}

string Task64(int n)
{
    if(n == 1) return "1";
    return $"{n} {Task64(n-1)}";
}

Console.WriteLine(Task64(GetNumber("Введите чило для задачи 64: ")));
Console.WriteLine(Task64(5));
Console.WriteLine(Task64(8));
